package main

import "fmt"

//定义一个函数，函数的参数为：可变参数 ...参数的数量可变
func test(args ...int) { //args英文是多个参数的意思，不是关键词，args...代表可以
	//传入任意多个数量的int类型的数据 传入0个，1个...n个
	for i, v := range args {
		fmt.Println(i, v)
	}
}
func main() {
	test() //传0个
	fmt.Println("================================================")
	test(1) //传1个
	fmt.Println("================================================")
	test(1, 2, 3, 4, 5, 45, 2, 3, 23, 12, 312, 3, 23, 1, 1) //传n个
	fmt.Println("================================================")
}
